Repository: EBRD-ProzorroSale/openregistry.assets.claimrights
Catalog: docs/source/locale/*/LC_MESSAGES/tutorial.po
Languages: uk

source: Tutorial
uk: Туторіал

source: Exploring basic rules
uk: Базові правила

source: Let's try exploring the `/assets` endpoint:
uk: Подивимось як працює точка входу `/assets`:

source: Just invoking it reveals empty set.
uk: При виклику видає пустий набір.

source: Now let's attempt creating some asset:
uk: Спробуймо створити новий актив

source: Error states that the only accepted Content-Type is `application/json`.
uk: Помилка вказує, що єдиний прийнятний тип вмісту це application/json.

source: Let's satisfy the Content-type requirement:
uk: Задовільнимо вимогу типу вмісту:

source: Error states that no `data` has been found in JSON body.
uk: Помилка вказує, що `data` не знайдено у тілі JSON.

source: Creating asset
uk: Створення активу

source: Let's create asset with the minimal (only required) data set:
uk: Створимо asset з мінімально допустимим набором даних (тільки параметри обовязкові для заповнення)

source: Success! Now we can see that new object was created. Response code is `201` and `Location` response header reports the location of the created object. The body of response reveals the information about the created asset: its internal `id` (that matches the `Location` segment), its official `assetID` and `dateModified` datestamp stating the moment in time when asset was last modified. Pay attention to the `assetType`. Note that asset is created with `pending` status.
uk: Успіх! Тепер ми бачимо, що новий об’єкт було створено. Код відповіді `201` та заголовок відповіді `Location` вказує місцерозташування створеного об’єкта. Тіло відповіді показує інформацію про створений актив, його внутрішній `id` (яке співпадає з сегментом `Location`), його офіційний `assetID` та `dateModified` (дату, що показує час, коли актив востаннє модифікувався). Зверніть увагу на `assetType`, а також на те, що актив створюється зі статусом `pending`.

source: Let's access the URL of the created object (the `Location` header of the response):
uk: Використаємо URL створеного об’єкта (заголовок відповіді `Location`):

source: We can see the same response we got after creating asset.
uk: Ми бачимо ту ж відповідь, що і після створення активу.

source: Let's see what listing of assets reveals us:
uk: Подивимось, що показує список активів:

source: We do see the internal `id` of a asset (that can be used to construct full URL by prepending `http://lb.api-sandbox.registry.openprocurement.net/api/0/assets/`) and its `dateModified` datestamp.
uk: Ми бачимо внутрішнє `id` активу (що може бути використано для побудови повної URL-адреси, якщо додати `http://lb.api-sandbox.registry.openprocurement.net/api/0/assets/`) та його dateModified дату.

source: The previous asset contained only required fields. Let's try creating asset with more data (asset has status `created`):
uk: Попередній актив був створений лише з обов’язковими полями. Тепер додамо актив з максимально допустимим набором даних при створенні (актив повинен бути у статусі `created`).

source: And again we have `201 Created` response code, `Location` header and body with extra `id`, `assetID`, and `dateModified` properties.
uk: І знову код відповіді `201 Created`, заголовок `Location` і тіло з додатковим `id`, `assetID`, та властивість `dateModified`.

source: Let's check what asset registry contains:
uk: Перевіримо, що містить реєстр активів:

source: Checking the listing again reflects the new modification date:
uk: Ще одна перевірка списку відображає нову дату модифікації:

source: Integration with lots
uk: Інтеграція з лотами

source: Assume we attached assets to lot:
uk: Припустімо, до лоту 'причеплено' активи:

source: Let`s change lot status to `recomposed`.
uk: Спробуймо перевести статус лоту в `recomposed`.

source: When bot finds such a lot, it turns status of the assets being attached to that lot to `pending`.
uk: Після виконання такої дії, активи 'відкріплюються' від лоту, відтак їхній статус атоматично переходить у `pending`.

source: Let's try exploring the `claimRights` endpoint:
uk: Подивимось як працює точка входу `claimRights`:

source: Now let's attempt creating some claimRights:
uk: Спробуймо створити нове право вимоги:

source: Let's create claim right with the minimal (only required) data set:
uk: Створимо claim right з мінімально допустимим набором даних (тільки параметри, обовязкові для заповнення):

source: Success! Now we can see that new object was created. Response code is `201` and `Location` response header reports the location of the created object. The body of response reveals the information about the created claim right: its internal `id` (that matches the `Location` segment), its official `assetID` and `dateModified` datestamp stating the moment in time when it was last modified. Pay attention to the `assetType`. Note that the object is created with `pending` status.
uk: Успіх! Тепер ми бачимо, що новий об’єкт було створено. Код відповіді 201 та заголовок відповіді Location вказує місцерозташування створеного об’єкта. Тіло відповіді показує інформацію про створене право вимоги, його внутрішній id (яке співпадає з сегментом Location), його офіційний assetID та dateModified (дату, що показує час, коли право вимоги востаннє модифікувалося). Зверніть увагу на assetType, а також на те, що право вимоги створюється зі статусом pending.

source: Let's see what listing of claim rights reveals us:
uk: Подивимось, що показує список прав вимоги:

source: We do see the internal `id` of the claim right and its `dateModified` datestamp.
uk: Ми бачимо внутрішнє id права вимоги та його dateModified дату.

source: The previous claim right contained only required fields. Let's try creating another one with more data (status `created`):
uk: Попереднє право вимоги було створене лише з обов’язковими полями. Тепер додамо право вимоги з максимально допустимим набором даних при створенні (право вимоги повинне бути у статусі created).

source: And indeed we have 2 objects now.
uk: Дійсно, в нас зараз є два активи.

source: Modifying Claim Right
uk: Модифікація права вимоги

source: Let's update claim right description:
uk: Оновимо право вимоги шляхом надання йому усіх інших важливих властивостей:

source: We see the added properies have merged with existing data. Additionally, the `dateModified` property was updated to reflect the last modification datestamp.
uk: Ми бачимо, що додаткові властивості об’єднані з існуючими даними права вимоги. Додатково оновлена властивість `dateModified`, щоб відображати останню дату модифікації.

source: Deleting Claim Right
uk: Видалення права вимоги

source: Let's delete it:
uk: Видалимо право вимоги
